; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v1 - type_2 ?v3 - type_3)
 	      (pred_1 ?v2 - object ?v3 - type_3)
	      (pred_2 ?v1 - type_2 ?v6 - type_1)
	      (pred_3 ?v1 - type_2 ?v2 - object ?v6 - type_1))

   (:action op_2
       :parameters  (?v1 - type_2 ?v4 ?v7 - type_3)
       :precondition (and  (pred_4 ?v1 ?v4))
       :effect (and  (pred_4 ?v1 ?v7)
		     (not (pred_4 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_2 ?v5 - object ?v8 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v8) (pred_4 ?v1 ?v8) (pred_2 ?v1 ?v6))
       :effect (and (pred_3 ?v1 ?v5 ?v6)
		    (not (pred_1 ?v5 ?v8)) 
		    (not (pred_2 ?v1 ?v6))))

   (:action op_3
       :parameters (?v1 - type_2 ?v5 - object ?v8 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v5 ?v6) (pred_4 ?v1 ?v8))
       :effect (and (pred_1 ?v5 ?v8)
		    (pred_2 ?v1 ?v6)
		    (not (pred_3 ?v1 ?v5 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_01 - type_2
obj_02 obj_09 obj_10 obj_04 - type_1
obj_05 obj_03 obj_08 obj_11 - type_3
obj_13 obj_06 obj_12 - object)
(:init
(pred_4 obj_07 obj_08)
(pred_2 obj_07 obj_02)
(pred_2 obj_07 obj_09)
(pred_4 obj_01 obj_11)
(pred_2 obj_01 obj_10)
(pred_2 obj_01 obj_04)
(pred_1 obj_13 obj_08)
(pred_1 obj_06 obj_05)
(pred_1 obj_12 obj_05)
)
(:goal
(and
(pred_1 obj_13 obj_11)
(pred_1 obj_06 obj_08)
(pred_1 obj_12 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_07 obj_11) (pred_4 obj_01 obj_11))))
  )
)
)

; plan
1. (op_1 obj_07 obj_13 obj_08 obj_09)
   deleted: (pred_1 obj_13 obj_08) (pred_2 obj_07 obj_09)
   added: (pred_3 obj_07 obj_13 obj_09)
   goals met: 0 of 3
2. (op_2 obj_01 obj_11 obj_08)
   deleted: (pred_4 obj_01 obj_11)
   added: (pred_4 obj_01 obj_08)
   goals met: 0 of 3
3. (op_2 obj_07 obj_08 obj_05)
   deleted: (pred_4 obj_07 obj_08)
   added: (pred_4 obj_07 obj_05)
   goals met: 0 of 3
4. (op_2 obj_01 obj_08 obj_05)
   deleted: (pred_4 obj_01 obj_08)
   added: (pred_4 obj_01 obj_05)
   goals met: 0 of 3
5. (op_1 obj_07 obj_12 obj_05 obj_02)
   deleted: (pred_1 obj_12 obj_05) (pred_2 obj_07 obj_02)
   added: (pred_3 obj_07 obj_12 obj_02)
   goals met: 0 of 3
6. (op_1 obj_01 obj_06 obj_05 obj_04)
   deleted: (pred_1 obj_06 obj_05) (pred_2 obj_01 obj_04)
   added: (pred_3 obj_01 obj_06 obj_04)
   goals met: 0 of 3
7. (op_2 obj_07 obj_05 obj_11)
   deleted: (pred_4 obj_07 obj_05)
   added: (pred_4 obj_07 obj_11)
   goals met: 0 of 3
8. (op_2 obj_01 obj_05 obj_08)
   deleted: (pred_4 obj_01 obj_05)
   added: (pred_4 obj_01 obj_08)
   goals met: 0 of 3
9. (op_3 obj_07 obj_12 obj_11 obj_02)
   deleted: (pred_3 obj_07 obj_12 obj_02)
   added: (pred_1 obj_12 obj_11) (pred_2 obj_07 obj_02)
   goals met: 1 of 3
10. (op_3 obj_07 obj_13 obj_11 obj_09)
   deleted: (pred_3 obj_07 obj_13 obj_09)
   added: (pred_1 obj_13 obj_11) (pred_2 obj_07 obj_09)
   goals met: 2 of 3
11. (op_3 obj_01 obj_06 obj_08 obj_04)
   deleted: (pred_3 obj_01 obj_06 obj_04)
   added: (pred_1 obj_06 obj_08) (pred_2 obj_01 obj_04)
   goals met: 3 of 3
